In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [2]:
df = pd.read_csv(r'athlete_events.csv', index_col = "ID")

In [3]:
df.head()

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
ID,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [4]:
df.columns

Index(['Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [5]:
df.dtypes

Name       object
Sex        object
Age       float64
Height    float64
Weight    float64
Team       object
NOC        object
Games      object
Year        int64
Season     object
City       object
Sport      object
Event      object
Medal      object
dtype: object

## How old were the youngest male and female participants of the 1992 Olympics?

In [6]:
df[df['Year'] == 1992][['Age', 'Sex']].groupby('Sex').min()

      Age
Sex
F    12.0
M    11.0

## What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.

In [7]:
df_nd = df.drop_duplicates(subset = 'Name')

In [8]:
df_2012 = df_nd[df_nd['Year'] == 2012]

In [9]:
basket_players_2012 = df_2012[(df_2012['Sport'] == 'Basketball') & (df_2012['Sex'] == 'M') & (df_2012['Year'] == 2012)].count()[0]
male_participants_2012 = df_2012[(df_2012['Year'] == 2012) & (df_2012['Sex'] == 'M')].count()[0]
round(basket_players_2012/male_participants_2012*100, 1)

2.7

## What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.

In [10]:
df_nd[(df_nd['Sex'] == 'F') & (df_nd['Sport'] == 'Tennis') & (df_nd['Year'] == 2000)][['Height']].agg(['mean', 'std'])

          Height
mean  172.450000
std     6.410862

## Find the heaviest athlete among 2006 Olympics participants. What sport did he or she do?

In [11]:
df[df['Year'] == 2006][['Sport', 'Weight']].groupby('Sport').max().sort_values('Weight',ascending = False).head(1)

          Weight
Sport
Skeleton   127.0

## How many times did John Aalberg participate in the Olympics held in different years?

In [12]:
df[df['Name'] == 'John Aalberg'][['Name', 'Year']].groupby('Year').nunique().count()[0]

2

In [13]:
len(df[df['Name'] == 'John Aalberg'].groupby('Year'))

2

## How many gold medals in tennis did the Switzerland team win at the 2008 Olympics?

In [14]:
len(df[
    (df['Year'] == 2008)
    & (df['Sport'] == 'Tennis')
    & (df['Medal'] == 'Gold')
    & (df['Team'] == 'Switzerland')
])

2

## Is it true that Spain won fewer medals than Italy at the 2016 Olympics? Do not consider NaN values in the Medal column.

In [15]:
df_medals = df[df['Year'] == 2016].dropna()

In [16]:
len(df_medals[df_medals['Team'] == 'Spain']) < len(df_medals[df_medals['Team'] == 'Italy'])

True

In [17]:
print(
    " Spain medals:", len(df_medals[df_medals['Team'] == 'Spain']), "\n",
    "Italy medals:", len(df_medals[df_medals['Team'] == 'Italy'])
)

 Spain medals: 43
 Italy medals: 70

## What are the least and most common age groups among the participants of the 2008 Olympics?

In [18]:
df_2008 = df[df['Year'] == 2008].drop_duplicates(subset = 'Name')

In [19]:
df_2008[['Age']].describe()

                Age
count  10879.000000
mean      25.954591
std        5.471613
min       12.000000
25%       22.000000
50%       25.000000
75%       29.000000
max       67.000000

In [20]:
def agecat(age):
    """ 
    Divide all ages by several categories
    """
    
    if age <15:
        return "<15"
    elif 15 <= age < 25:
        return "15 - 25"
    elif 25 <= age < 35:
        return "25 - 35"
    elif 35 <= age < 45:
        return "35 - 45"
    elif 45 <= age < 55:
        return "45 - 55"
    elif 55 <= age < 65:
        return "55 - 65"
    else: return ">65"

In [21]:
df_2008['Age group'] = df_2008.Age.map(agecat)

In [22]:
df_2008.groupby('Age group').size()

Age group
15 - 25    4776
25 - 35    5373
35 - 45     630
45 - 55      76
55 - 65      10
<15          13
>65           2
dtype: int64

## Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?

In [23]:
pd.crosstab(df.City, df.Season).loc[['Atlanta', 'Squaw Valley']]

Season        Summer  Winter
City
Atlanta        13780       0
Squaw Valley       0    1116

## What is the absolute difference between the number of unique sports at the 1994 Olympics and 2002 Olympics?

In [24]:
sports_1994 = df[df.Year == 1994][['Sport']].nunique()
sports_2002 = df[df.Year == 2002][['Sport']].nunique()

In [25]:
print(
    " Number of sports in 1994:", sports_1994[0], "\n",
    "Number of sports in 2002:", sports_2002[0], "\n",
    "Difference:", sports_2002[0] - sports_1994[0]
)

 Number of sports in 1994: 12
 Number of sports in 2002: 15
 Difference: 3